# Дано слово из маленьких латинских букв. Сколько там согласных и гласных букв? Гласными называют буквы «a», «e», «i», «o», «u».
# Для решения задачи создайте переменную и в неё положите слово с помощью input()
# А также определите количество каждой из этих гласных букв Если какой-то из перечисленных букв нет - Выведите False


# Добавил метод .lower(), что бы не иметь привязки к регистру, но данный метод мы пока не изучали

word = input("Введите слово латинскими буквами: ").lower() # Запрос ввода слова у пользователя

glas = ("aeiouy")
sh_glas = 0 # Создаем счетчик гласных букв

a = 0
e = 0
i = 0
o = 0
u = 0
y = 0

for let in word: # Создаем цикл, что бы переменная
    if let in glas:
        sh_glas += 1
        if let == "a":
            a += 1
        elif let == "e":
            e += 1
        elif let == "i":
            i += 1
        elif let == "o":
            o += 1
        elif let == "u":
            u += 1
        elif let == "y":
            y += 1

print("Всего гласных букв: ", sh_glas)
print("Букв 'a': ", a)
print("Букв 'e': ", e)
print("Букв 'i': ", i)
print("Букв 'o': ", o)
print("Букв 'u': ", u)
print("Букв 'y': ", y)