# Дано слово из маленьких латинских букв. Сколько там согласных и гласных букв? Гласными называют буквы «a», «e», «i», «o», «u».
# Для решения задачи создайте переменную и в неё положите слово с помощью input()
# А также определите количество каждой из этих гласных букв Если какой-то из перечисленных букв нет - Выведите False


word = input("Введите слово латинскими буквами: ").lower() # Запрос ввода слова у пользователя
glas = ("aeiouy")           # Создаем переменную с гласными буквами, для дальнейший фильтрации и подсчета букв
sh_glas = 0                 # Создаем счетчик гласных букв
# Далее создаем счетчики каждой гласной буквы:
a = 0
e = 0
i = 0
o = 0
u = 0
y = 0

for let in word:            # Создаем цикл, что бы переменная len принимала значения по порядку из переменной word, в результате переменную word мы разбиваем на отдельные буквы
    if let in glas:         # Создаём условие, что при каждом выполнении цикла и при каждом совпадении значения из переменной glass, выполнить следущее:
        sh_glas += 1        # Добавляем единицу в счетчик sh_glas 
        if let == "a":      # Создаём условие, что если переменная let приняла значение "a", то выполнить следующее:
            a += 1          # Добавляем единицу в счетчик буквы 
        elif let == "e":    # Далее создаем условия по аналогии
            e += 1
        elif let == "i":
            i += 1
        elif let == "o":
            o += 1
        elif let == "u":
            u += 1
        elif let == "y":
            y += 1
# Выводим получивщиеся значения переменных:
print("Всего гласных букв: ", sh_glas)
print("Букв 'a': ", a)
print("Букв 'e': ", e)
print("Букв 'i': ", i)
print("Букв 'o': ", o)
print("Букв 'u': ", u)
print("Букв 'y': ", y)